; ModuleID = 'injection_kern.c'
source_filename = "injection_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_elf_map = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.__sk_buff = type { i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, [5 x i32], i32, i32, i32, i32, i32, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, %union.anon, i64, i32, i32, %union.anon.2 }
%union.anon = type { %struct.bpf_flow_keys* }
%struct.bpf_flow_keys = type { i16, i16, i16, i8, i8, i8, i8, i16, i16, i16, %union.anon.0 }
%union.anon.0 = type { %struct.anon.1 }
%struct.anon.1 = type { [4 x i32], [4 x i32] }
%union.anon.2 = type { %struct.bpf_sock* }
%struct.bpf_sock = type { i32, i32, i32, i32, i32, i32, i32, [4 x i32], i32, i32, i32, [4 x i32], i32 }

@DEBUGS_MAP = global %struct.bpf_elf_map { i32 2, i32 4, i32 1, i32 1, i32 0, i32 0, i32 2 }, section "maps", align 4, !dbg !0
@_license = global [4 x i8] c"GPL\00", section "license", align 1, !dbg !6
@llvm.used = appending global [3 x i8*] [i8* bitcast (%struct.bpf_elf_map* @DEBUGS_MAP to i8*), i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (i32 (%struct.__sk_buff*)* @_tf_tc_egress to i8*)], section "llvm.metadata"

; Function Attrs: nounwind readnone
define i32 @_tf_tc_egress(%struct.__sk_buff* nocapture readnone) #0 section "tf_tc_egress" !dbg !29 {
  call void @llvm.dbg.value(metadata %struct.__sk_buff* %0, metadata !130, metadata !DIExpression()), !dbg !131
  ret i32 0, !dbg !132
}

; Function Attrs: nounwind readnone speculatable
declare void @llvm.dbg.value(metadata, metadata, metadata) #1

attributes #0 = { nounwind readnone "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="true" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "unsafe-fp-math"="false" "use-soft-float"="false" }
attributes #1 = { nounwind readnone speculatable }

!llvm.dbg.cu = !{!2}
!llvm.module.flags = !{!25, !26, !27}
!llvm.ident = !{!28}

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DEBUGS_MAP", scope: !2, file: !3, line: 39, type: !12, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "injection_kern.c", directory: "/home/ubuntu/Hooker/injection")
!4 = !{}
!5 = !{!0, !6}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 133, type: !8, isLocal: false, isDefinition: true)
!8 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32, elements: !10)
!9 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!10 = !{!11}
!11 = !DISubrange(count: 4)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_elf_map", file: !13, line: 18, size: 224, elements: !14)
!13 = !DIFile(filename: "../headers/tc_bpf_util.h", directory: "/home/ubuntu/Hooker/injection")
!14 = !{!15, !19, !20, !21, !22, !23, !24}
!15 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !12, file: !13, line: 23, baseType: !16, size: 32)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !17, line: 27, baseType: !18)
!17 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/ubuntu/Hooker/injection")
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "size_key", scope: !12, file: !13, line: 24, baseType: !16, size: 32, offset: 32)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "size_value", scope: !12, file: !13, line: 25, baseType: !16, size: 32, offset: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "max_elem", scope: !12, file: !13, line: 26, baseType: !16, size: 32, offset: 96)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !12, file: !13, line: 30, baseType: !16, size: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !12, file: !13, line: 31, baseType: !16, size: 32, offset: 160)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pinning", scope: !12, file: !13, line: 40, baseType: !16, size: 32, offset: 192)
!25 = !{i32 2, !"Dwarf Version", i32 4}
!26 = !{i32 2, !"Debug Info Version", i32 3}
!27 = !{i32 1, !"wchar_size", i32 4}
!28 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!29 = distinct !DISubprogram(name: "_tf_tc_egress", scope: !3, file: !3, line: 76, type: !30, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !129)
!30 = !DISubroutineType(types: !31)
!31 = !{!32, !33}
!32 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !35, line: 2677, size: 1408, elements: !36)
!35 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/ubuntu/Hooker/injection")
!36 = !{!37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !53, !54, !55, !56, !57, !58, !59, !60, !61, !63, !64, !65, !66, !67, !104, !107, !108, !109}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !34, file: !35, line: 2678, baseType: !16, size: 32)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !34, file: !35, line: 2679, baseType: !16, size: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !34, file: !35, line: 2680, baseType: !16, size: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !34, file: !35, line: 2681, baseType: !16, size: 32, offset: 96)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !34, file: !35, line: 2682, baseType: !16, size: 32, offset: 128)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !34, file: !35, line: 2683, baseType: !16, size: 32, offset: 160)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !34, file: !35, line: 2684, baseType: !16, size: 32, offset: 192)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !34, file: !35, line: 2685, baseType: !16, size: 32, offset: 224)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !34, file: !35, line: 2686, baseType: !16, size: 32, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !34, file: !35, line: 2687, baseType: !16, size: 32, offset: 288)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !34, file: !35, line: 2688, baseType: !16, size: 32, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !34, file: !35, line: 2689, baseType: !16, size: 32, offset: 352)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !34, file: !35, line: 2690, baseType: !50, size: 160, offset: 384)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 160, elements: !51)
!51 = !{!52}
!52 = !DISubrange(count: 5)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !34, file: !35, line: 2691, baseType: !16, size: 32, offset: 544)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !34, file: !35, line: 2692, baseType: !16, size: 32, offset: 576)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !34, file: !35, line: 2693, baseType: !16, size: 32, offset: 608)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !34, file: !35, line: 2694, baseType: !16, size: 32, offset: 640)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !34, file: !35, line: 2695, baseType: !16, size: 32, offset: 672)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !34, file: !35, line: 2698, baseType: !16, size: 32, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !34, file: !35, line: 2699, baseType: !16, size: 32, offset: 736)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !34, file: !35, line: 2700, baseType: !16, size: 32, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !34, file: !35, line: 2701, baseType: !62, size: 128, offset: 800)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 128, elements: !10)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !34, file: !35, line: 2702, baseType: !62, size: 128, offset: 928)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !34, file: !35, line: 2703, baseType: !16, size: 32, offset: 1056)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !34, file: !35, line: 2704, baseType: !16, size: 32, offset: 1088)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !34, file: !35, line: 2707, baseType: !16, size: 32, offset: 1120)
!67 = !DIDerivedType(tag: DW_TAG_member, scope: !34, file: !35, line: 2708, baseType: !68, size: 64, align: 64, offset: 1152)
!68 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !34, file: !35, line: 2708, size: 64, align: 64, elements: !69)
!69 = !{!70}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !68, file: !35, line: 2708, baseType: !71, size: 64)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !35, line: 3237, size: 384, elements: !73)
!73 = !{!74, !77, !78, !79, !82, !83, !84, !85, !88, !89, !90}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !72, file: !35, line: 3238, baseType: !75, size: 16)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !17, line: 24, baseType: !76)
!76 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !72, file: !35, line: 3239, baseType: !75, size: 16, offset: 16)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !72, file: !35, line: 3240, baseType: !75, size: 16, offset: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !72, file: !35, line: 3241, baseType: !80, size: 8, offset: 48)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !17, line: 21, baseType: !81)
!81 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !72, file: !35, line: 3242, baseType: !80, size: 8, offset: 56)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !72, file: !35, line: 3243, baseType: !80, size: 8, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !72, file: !35, line: 3244, baseType: !80, size: 8, offset: 72)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !72, file: !35, line: 3245, baseType: !86, size: 16, offset: 80)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !87, line: 25, baseType: !75)
!87 = !DIFile(filename: "/usr/include/linux/types.h", directory: "/home/ubuntu/Hooker/injection")
!88 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !72, file: !35, line: 3246, baseType: !86, size: 16, offset: 96)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !72, file: !35, line: 3247, baseType: !86, size: 16, offset: 112)
!90 = !DIDerivedType(tag: DW_TAG_member, scope: !72, file: !35, line: 3248, baseType: !91, size: 256, offset: 128)
!91 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !72, file: !35, line: 3248, size: 256, elements: !92)
!92 = !{!93, !99}
!93 = !DIDerivedType(tag: DW_TAG_member, scope: !91, file: !35, line: 3249, baseType: !94, size: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !91, file: !35, line: 3249, size: 64, elements: !95)
!95 = !{!96, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !94, file: !35, line: 3250, baseType: !97, size: 32)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !87, line: 27, baseType: !16)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !94, file: !35, line: 3251, baseType: !97, size: 32, offset: 32)
!99 = !DIDerivedType(tag: DW_TAG_member, scope: !91, file: !35, line: 3253, baseType: !100, size: 256)
!100 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !91, file: !35, line: 3253, size: 256, elements: !101)
!101 = !{!102, !103}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !100, file: !35, line: 3254, baseType: !62, size: 128)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !100, file: !35, line: 3255, baseType: !62, size: 128, offset: 128)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !34, file: !35, line: 2709, baseType: !105, size: 64, offset: 1216)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !17, line: 31, baseType: !106)
!106 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !34, file: !35, line: 2710, baseType: !16, size: 32, offset: 1280)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !34, file: !35, line: 2711, baseType: !16, size: 32, offset: 1312)
!109 = !DIDerivedType(tag: DW_TAG_member, scope: !34, file: !35, line: 2712, baseType: !110, size: 64, align: 64, offset: 1344)
!110 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !34, file: !35, line: 2712, size: 64, align: 64, elements: !111)
!111 = !{!112}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !110, file: !35, line: 2712, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !35, line: 2765, size: 608, elements: !115)
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !114, file: !35, line: 2766, baseType: !16, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !114, file: !35, line: 2767, baseType: !16, size: 32, offset: 32)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !114, file: !35, line: 2768, baseType: !16, size: 32, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !114, file: !35, line: 2769, baseType: !16, size: 32, offset: 96)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !114, file: !35, line: 2770, baseType: !16, size: 32, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !114, file: !35, line: 2771, baseType: !16, size: 32, offset: 160)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !114, file: !35, line: 2773, baseType: !16, size: 32, offset: 192)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !114, file: !35, line: 2774, baseType: !62, size: 128, offset: 224)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !114, file: !35, line: 2775, baseType: !16, size: 32, offset: 352)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !114, file: !35, line: 2776, baseType: !16, size: 32, offset: 384)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !114, file: !35, line: 2777, baseType: !16, size: 32, offset: 416)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !114, file: !35, line: 2778, baseType: !62, size: 128, offset: 448)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !114, file: !35, line: 2779, baseType: !16, size: 32, offset: 576)
!129 = !{!130}
!130 = !DILocalVariable(name: "skb", arg: 1, scope: !29, file: !3, line: 76, type: !33)
!131 = !DILocation(line: 76, column: 37, scope: !29)
!132 = !DILocation(line: 130, column: 9, scope: !29)
