; ModuleID = 'xdp_prog_kern.c'
source_filename = "xdp_prog_kern.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.hdr_cursor = type { i8* }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.icmphdr_common = type { i8, i8, i16 }
%struct.bpf_fib_lookup = type { i8, i8, i16, i16, i16, i32, %union.anon.0, %union.anon.1, %union.anon.2, i16, i16, [6 x i8], [6 x i8] }
%union.anon.0 = type { i32 }
%union.anon.1 = type { [4 x i32] }
%union.anon.2 = type { [4 x i32] }

@xdp_stats_map = dso_local global %struct.bpf_map_def { i32 6, i32 4, i32 16, i32 5, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !0
@tx_port = dso_local global %struct.bpf_map_def { i32 14, i32 4, i32 4, i32 256, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !50
@redirect_params = dso_local global %struct.bpf_map_def { i32 1, i32 6, i32 6, i32 1, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !62
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !64

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "xdp_stats_map", scope: !2, file: !125, line: 16, type: !52, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.0 (Fedora 8.0.0-1.fc30)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !49, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern.c", directory: "/home/fedora/xdp-tutorial/packet03-redirecting")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/fedora/xdp-tutorial/packet03-redirecting")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!43 = !{!44, !45, !46}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !47, line: 24, baseType: !48)
!47 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !{!0, !50, !62, !64, !70, !75, !81}
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 18, type: !52, isLocal: false, isDefinition: true)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !53, line: 210, size: 224, elements: !54)
!53 = !DIFile(filename: "../headers/bpf_helpers.h", directory: "/home/fedora/xdp-tutorial/packet03-redirecting")
!54 = !{!55, !56, !57, !58, !59, !60, !61}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !52, file: !53, line: 211, baseType: !7, size: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !52, file: !53, line: 212, baseType: !7, size: 32, offset: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !52, file: !53, line: 213, baseType: !7, size: 32, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !52, file: !53, line: 214, baseType: !7, size: 32, offset: 96)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !52, file: !53, line: 215, baseType: !7, size: 32, offset: 128)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_idx", scope: !52, file: !53, line: 216, baseType: !7, size: 32, offset: 160)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !52, file: !53, line: 217, baseType: !7, size: 32, offset: 192)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "redirect_params", scope: !2, file: !3, line: 25, type: !52, isLocal: false, isDefinition: true)
!64 = !DIGlobalVariableExpression(var: !65, expr: !DIExpression())
!65 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 274, type: !66, isLocal: false, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 32, elements: !68)
!67 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!68 = !{!69}
!69 = !DISubrange(count: 4)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !53, line: 20, type: !72, isLocal: true, isDefinition: true)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DISubroutineType(types: !74)
!74 = !{!44, !44, !44}
!75 = !DIGlobalVariableExpression(var: !76, expr: !DIExpression())
!76 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !53, line: 57, type: !77, isLocal: true, isDefinition: true)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !44, !80, !80}
!80 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!81 = !DIGlobalVariableExpression(var: !82, expr: !DIExpression())
!82 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !53, line: 137, type: !83, isLocal: true, isDefinition: true)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DISubroutineType(types: !85)
!85 = !{!80, !44, !86, !80, !99}
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 3179, size: 512, elements: !88)
!88 = !{!89, !92, !93, !96, !97, !98, !100, !107, !113, !118, !119, !120, !124}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !87, file: !6, line: 3183, baseType: !90, size: 8)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !47, line: 21, baseType: !91)
!91 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !87, file: !6, line: 3186, baseType: !90, size: 8, offset: 8)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !87, file: !6, line: 3187, baseType: !94, size: 16, offset: 16)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !95, line: 25, baseType: !46)
!95 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!96 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !87, file: !6, line: 3188, baseType: !94, size: 16, offset: 32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !87, file: !6, line: 3191, baseType: !46, size: 16, offset: 48)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !87, file: !6, line: 3196, baseType: !99, size: 32, offset: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !47, line: 27, baseType: !7)
!100 = !DIDerivedType(tag: DW_TAG_member, scope: !87, file: !6, line: 3198, baseType: !101, size: 32, offset: 96)
!101 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !87, file: !6, line: 3198, size: 32, elements: !102)
!102 = !{!103, !104, !106}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !101, file: !6, line: 3200, baseType: !90, size: 8)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !101, file: !6, line: 3201, baseType: !105, size: 32)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !95, line: 27, baseType: !99)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !101, file: !6, line: 3204, baseType: !99, size: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, scope: !87, file: !6, line: 3207, baseType: !108, size: 128, offset: 128)
!108 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !87, file: !6, line: 3207, size: 128, elements: !109)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !108, file: !6, line: 3208, baseType: !105, size: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !108, file: !6, line: 3209, baseType: !112, size: 128)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !99, size: 128, elements: !68)
!113 = !DIDerivedType(tag: DW_TAG_member, scope: !87, file: !6, line: 3216, baseType: !114, size: 128, offset: 256)
!114 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !87, file: !6, line: 3216, size: 128, elements: !115)
!115 = !{!116, !117}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !114, file: !6, line: 3217, baseType: !105, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !114, file: !6, line: 3218, baseType: !112, size: 128)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !87, file: !6, line: 3222, baseType: !94, size: 16, offset: 384)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !87, file: !6, line: 3223, baseType: !94, size: 16, offset: 400)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !87, file: !6, line: 3224, baseType: !121, size: 48, offset: 416)
!121 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 48, elements: !122)
!122 = !{!123}
!123 = !DISubrange(count: 6)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !87, file: !6, line: 3225, baseType: !121, size: 48, offset: 464)
!125 = !DIFile(filename: "./../common/xdp_stats_kern.h", directory: "/home/fedora/xdp-tutorial/packet03-redirecting")
!126 = !{i32 2, !"Dwarf Version", i32 4}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{i32 1, !"wchar_size", i32 4}
!129 = !{!"clang version 8.0.0 (Fedora 8.0.0-1.fc30)"}
!130 = distinct !DISubprogram(name: "xdp_icmp_echo_func", scope: !3, file: !3, line: 49, type: !131, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !141)
!131 = !DISubroutineType(types: !132)
!132 = !{!80, !133}
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !134, size: 64)
!134 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !135)
!135 = !{!136, !137, !138, !139, !140}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !134, file: !6, line: 2857, baseType: !99, size: 32)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !134, file: !6, line: 2858, baseType: !99, size: 32, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !134, file: !6, line: 2859, baseType: !99, size: 32, offset: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !134, file: !6, line: 2861, baseType: !99, size: 32, offset: 96)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !134, file: !6, line: 2862, baseType: !99, size: 32, offset: 128)
!141 = !{!142, !143, !144, !145, !150, !159, !160, !161, !162, !179, !211, !212, !219}
!142 = !DILocalVariable(name: "ctx", arg: 1, scope: !130, file: !3, line: 49, type: !133)
!143 = !DILocalVariable(name: "data_end", scope: !130, file: !3, line: 51, type: !44)
!144 = !DILocalVariable(name: "data", scope: !130, file: !3, line: 52, type: !44)
!145 = !DILocalVariable(name: "nh", scope: !130, file: !3, line: 53, type: !146)
!146 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !147, line: 33, size: 64, elements: !148)
!147 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/fedora/xdp-tutorial/packet03-redirecting")
!148 = !{!149}
!149 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !146, file: !147, line: 34, baseType: !44, size: 64)
!150 = !DILocalVariable(name: "eth", scope: !130, file: !3, line: 54, type: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !153, line: 161, size: 112, elements: !154)
!153 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!154 = !{!155, !157, !158}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !152, file: !153, line: 162, baseType: !156, size: 48)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !91, size: 48, elements: !122)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !152, file: !153, line: 163, baseType: !156, size: 48, offset: 48)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !152, file: !153, line: 164, baseType: !94, size: 16, offset: 96)
!159 = !DILocalVariable(name: "eth_type", scope: !130, file: !3, line: 55, type: !80)
!160 = !DILocalVariable(name: "ip_type", scope: !130, file: !3, line: 56, type: !80)
!161 = !DILocalVariable(name: "icmp_type", scope: !130, file: !3, line: 57, type: !80)
!162 = !DILocalVariable(name: "iphdr", scope: !130, file: !3, line: 58, type: !163)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !165, line: 86, size: 160, elements: !166)
!165 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!166 = !{!167, !168, !169, !170, !171, !172, !173, !174, !175, !177, !178}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !164, file: !165, line: 88, baseType: !90, size: 4, flags: DIFlagBitField, extraData: i64 0)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !164, file: !165, line: 89, baseType: !90, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !164, file: !165, line: 96, baseType: !90, size: 8, offset: 8)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !164, file: !165, line: 97, baseType: !94, size: 16, offset: 16)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !164, file: !165, line: 98, baseType: !94, size: 16, offset: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !164, file: !165, line: 99, baseType: !94, size: 16, offset: 48)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !164, file: !165, line: 100, baseType: !90, size: 8, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !164, file: !165, line: 101, baseType: !90, size: 8, offset: 72)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !164, file: !165, line: 102, baseType: !176, size: 16, offset: 80)
!176 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !95, line: 31, baseType: !46)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !164, file: !165, line: 103, baseType: !105, size: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !164, file: !165, line: 104, baseType: !105, size: 32, offset: 128)
!179 = !DILocalVariable(name: "ipv6hdr", scope: !130, file: !3, line: 59, type: !180)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !182, line: 116, size: 320, elements: !183)
!182 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!183 = !{!184, !185, !186, !190, !191, !192, !193, !210}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !181, file: !182, line: 118, baseType: !90, size: 4, flags: DIFlagBitField, extraData: i64 0)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !181, file: !182, line: 119, baseType: !90, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !181, file: !182, line: 126, baseType: !187, size: 24, offset: 8)
!187 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 24, elements: !188)
!188 = !{!189}
!189 = !DISubrange(count: 3)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !181, file: !182, line: 128, baseType: !94, size: 16, offset: 32)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !181, file: !182, line: 129, baseType: !90, size: 8, offset: 48)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !181, file: !182, line: 130, baseType: !90, size: 8, offset: 56)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !181, file: !182, line: 132, baseType: !194, size: 128, offset: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !195, line: 33, size: 128, elements: !196)
!195 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !194, file: !195, line: 40, baseType: !198, size: 128)
!198 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !194, file: !195, line: 34, size: 128, elements: !199)
!199 = !{!200, !204, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !198, file: !195, line: 35, baseType: !201, size: 128)
!201 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 128, elements: !202)
!202 = !{!203}
!203 = !DISubrange(count: 16)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !198, file: !195, line: 37, baseType: !205, size: 128)
!205 = !DICompositeType(tag: DW_TAG_array_type, baseType: !94, size: 128, elements: !206)
!206 = !{!207}
!207 = !DISubrange(count: 8)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !198, file: !195, line: 38, baseType: !209, size: 128)
!209 = !DICompositeType(tag: DW_TAG_array_type, baseType: !105, size: 128, elements: !68)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !181, file: !182, line: 133, baseType: !194, size: 128, offset: 192)
!211 = !DILocalVariable(name: "echo_reply", scope: !130, file: !3, line: 60, type: !46)
!212 = !DILocalVariable(name: "icmphdr", scope: !130, file: !3, line: 61, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr_common", file: !147, line: 51, size: 32, elements: !215)
!215 = !{!216, !217, !218}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !214, file: !147, line: 52, baseType: !90, size: 8)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !214, file: !147, line: 53, baseType: !90, size: 8, offset: 8)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !214, file: !147, line: 54, baseType: !176, size: 16, offset: 16)
!219 = !DILocalVariable(name: "action", scope: !130, file: !3, line: 62, type: !99)
!220 = !DILocation(line: 49, column: 39, scope: !130)
!221 = !DILocation(line: 51, column: 38, scope: !130)
!222 = !{!223, !224, i64 4}
!223 = !{!"xdp_md", !224, i64 0, !224, i64 4, !224, i64 8, !224, i64 12, !224, i64 16}
!224 = !{!"int", !225, i64 0}
!225 = !{!"omnipotent char", !226, i64 0}
!226 = !{!"Simple C/C++ TBAA"}
!227 = !DILocation(line: 51, column: 27, scope: !130)
!228 = !DILocation(line: 51, column: 19, scope: !130)
!229 = !DILocation(line: 51, column: 8, scope: !130)
!230 = !DILocation(line: 52, column: 34, scope: !130)
!231 = !{!223, !224, i64 0}
!232 = !DILocation(line: 52, column: 23, scope: !130)
!233 = !DILocation(line: 52, column: 15, scope: !130)
!234 = !DILocation(line: 52, column: 8, scope: !130)
!235 = !DILocation(line: 62, column: 8, scope: !130)
!236 = !DILocation(line: 53, column: 20, scope: !130)
!237 = !DILocation(line: 54, column: 17, scope: !130)
!238 = !DILocalVariable(name: "nh", arg: 1, scope: !239, file: !147, line: 73, type: !242)
!239 = distinct !DISubprogram(name: "parse_ethhdr", scope: !147, file: !147, line: 73, type: !240, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !244)
!240 = !DISubroutineType(types: !241)
!241 = !{!80, !242, !44, !243}
!242 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!244 = !{!238, !245, !246, !247, !248, !249, !255, !256}
!245 = !DILocalVariable(name: "data_end", arg: 2, scope: !239, file: !147, line: 73, type: !44)
!246 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !239, file: !147, line: 74, type: !243)
!247 = !DILocalVariable(name: "eth", scope: !239, file: !147, line: 76, type: !151)
!248 = !DILocalVariable(name: "hdrsize", scope: !239, file: !147, line: 77, type: !80)
!249 = !DILocalVariable(name: "vlh", scope: !239, file: !147, line: 78, type: !250)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !147, line: 42, size: 32, elements: !252)
!252 = !{!253, !254}
!253 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !251, file: !147, line: 43, baseType: !94, size: 16)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !251, file: !147, line: 44, baseType: !94, size: 16, offset: 16)
!255 = !DILocalVariable(name: "h_proto", scope: !239, file: !147, line: 79, type: !46)
!256 = !DILocalVariable(name: "i", scope: !239, file: !147, line: 80, type: !80)
!257 = !DILocation(line: 73, column: 60, scope: !239, inlinedAt: !258)
!258 = distinct !DILocation(line: 68, column: 13, scope: !130)
!259 = !DILocation(line: 73, column: 70, scope: !239, inlinedAt: !258)
!260 = !DILocation(line: 74, column: 22, scope: !239, inlinedAt: !258)
!261 = !DILocation(line: 77, column: 6, scope: !239, inlinedAt: !258)
!262 = !DILocation(line: 85, column: 14, scope: !263, inlinedAt: !258)
!263 = distinct !DILexicalBlock(scope: !239, file: !147, line: 85, column: 6)
!264 = !DILocation(line: 85, column: 24, scope: !263, inlinedAt: !258)
!265 = !DILocation(line: 85, column: 6, scope: !239, inlinedAt: !258)
!266 = !DILocation(line: 76, column: 17, scope: !239, inlinedAt: !258)
!267 = !DILocation(line: 78, column: 19, scope: !239, inlinedAt: !258)
!268 = !DILocation(line: 91, column: 17, scope: !239, inlinedAt: !258)
!269 = !DILocation(line: 79, column: 8, scope: !239, inlinedAt: !258)
!270 = !DILocation(line: 80, column: 6, scope: !239, inlinedAt: !258)
!271 = !DILocation(line: 0, scope: !239, inlinedAt: !258)
!272 = !{!273, !273, i64 0}
!273 = !{!"short", !225, i64 0}
!274 = !DILocation(line: 98, column: 7, scope: !275, inlinedAt: !258)
!275 = distinct !DILexicalBlock(scope: !276, file: !147, line: 97, column: 39)
!276 = distinct !DILexicalBlock(scope: !277, file: !147, line: 97, column: 2)
!277 = distinct !DILexicalBlock(scope: !239, file: !147, line: 97, column: 2)
!278 = !DILocation(line: 101, column: 11, scope: !279, inlinedAt: !258)
!279 = distinct !DILexicalBlock(scope: !275, file: !147, line: 101, column: 7)
!280 = !DILocation(line: 101, column: 15, scope: !279, inlinedAt: !258)
!281 = !DILocation(line: 101, column: 7, scope: !275, inlinedAt: !258)
!282 = !DILocation(line: 104, column: 18, scope: !275, inlinedAt: !258)
!283 = !DILocation(line: 55, column: 6, scope: !130)
!284 = !DILocation(line: 69, column: 6, scope: !130)
!285 = !DILocation(line: 58, column: 16, scope: !130)
!286 = !DILocalVariable(name: "nh", arg: 1, scope: !287, file: !147, line: 131, type: !242)
!287 = distinct !DISubprogram(name: "parse_iphdr", scope: !147, file: !147, line: 131, type: !288, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !291)
!288 = !DISubroutineType(types: !289)
!289 = !{!80, !242, !44, !290}
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!291 = !{!286, !292, !293, !294, !295}
!292 = !DILocalVariable(name: "data_end", arg: 2, scope: !287, file: !147, line: 132, type: !44)
!293 = !DILocalVariable(name: "iphdr", arg: 3, scope: !287, file: !147, line: 133, type: !290)
!294 = !DILocalVariable(name: "iph", scope: !287, file: !147, line: 135, type: !163)
!295 = !DILocalVariable(name: "hdrsize", scope: !287, file: !147, line: 136, type: !80)
!296 = !DILocation(line: 131, column: 59, scope: !287, inlinedAt: !297)
!297 = distinct !DILocation(line: 70, column: 13, scope: !298)
!298 = distinct !DILexicalBlock(scope: !299, file: !3, line: 69, column: 39)
!299 = distinct !DILexicalBlock(scope: !130, file: !3, line: 69, column: 6)
!300 = !DILocation(line: 132, column: 18, scope: !287, inlinedAt: !297)
!301 = !DILocation(line: 133, column: 27, scope: !287, inlinedAt: !297)
!302 = !DILocation(line: 135, column: 16, scope: !287, inlinedAt: !297)
!303 = !DILocation(line: 138, column: 10, scope: !304, inlinedAt: !297)
!304 = distinct !DILexicalBlock(scope: !287, file: !147, line: 138, column: 6)
!305 = !DILocation(line: 138, column: 14, scope: !304, inlinedAt: !297)
!306 = !DILocation(line: 138, column: 6, scope: !287, inlinedAt: !297)
!307 = !DILocation(line: 141, column: 17, scope: !287, inlinedAt: !297)
!308 = !DILocation(line: 141, column: 21, scope: !287, inlinedAt: !297)
!309 = !DILocation(line: 144, column: 14, scope: !310, inlinedAt: !297)
!310 = distinct !DILexicalBlock(scope: !287, file: !147, line: 144, column: 6)
!311 = !DILocation(line: 136, column: 6, scope: !287, inlinedAt: !297)
!312 = !DILocation(line: 144, column: 24, scope: !310, inlinedAt: !297)
!313 = !DILocation(line: 144, column: 6, scope: !287, inlinedAt: !297)
!314 = !DILocation(line: 150, column: 14, scope: !287, inlinedAt: !297)
!315 = !{!316, !225, i64 9}
!316 = !{!"iphdr", !225, i64 0, !225, i64 0, !225, i64 1, !273, i64 2, !273, i64 4, !273, i64 6, !225, i64 8, !225, i64 9, !273, i64 10, !224, i64 12, !224, i64 16}
!317 = !DILocation(line: 71, column: 15, scope: !318)
!318 = distinct !DILexicalBlock(scope: !298, file: !3, line: 71, column: 7)
!319 = !DILocation(line: 71, column: 7, scope: !298)
!320 = !DILocalVariable(name: "nh", arg: 1, scope: !321, file: !147, line: 112, type: !242)
!321 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !147, file: !147, line: 112, type: !322, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !325)
!322 = !DISubroutineType(types: !323)
!323 = !{!80, !242, !44, !324}
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!325 = !{!320, !326, !327, !328}
!326 = !DILocalVariable(name: "data_end", arg: 2, scope: !321, file: !147, line: 113, type: !44)
!327 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !321, file: !147, line: 114, type: !324)
!328 = !DILocalVariable(name: "ip6h", scope: !321, file: !147, line: 116, type: !180)
!329 = !DILocation(line: 112, column: 60, scope: !321, inlinedAt: !330)
!330 = distinct !DILocation(line: 74, column: 13, scope: !331)
!331 = distinct !DILexicalBlock(scope: !332, file: !3, line: 73, column: 48)
!332 = distinct !DILexicalBlock(scope: !299, file: !3, line: 73, column: 13)
!333 = !DILocation(line: 113, column: 12, scope: !321, inlinedAt: !330)
!334 = !DILocation(line: 122, column: 11, scope: !335, inlinedAt: !330)
!335 = distinct !DILexicalBlock(scope: !321, file: !147, line: 122, column: 6)
!336 = !DILocation(line: 122, column: 17, scope: !335, inlinedAt: !330)
!337 = !DILocation(line: 122, column: 15, scope: !335, inlinedAt: !330)
!338 = !DILocation(line: 122, column: 6, scope: !321, inlinedAt: !330)
!339 = !DILocation(line: 116, column: 18, scope: !321, inlinedAt: !330)
!340 = !DILocation(line: 128, column: 15, scope: !321, inlinedAt: !330)
!341 = !{!342, !225, i64 6}
!342 = !{!"ipv6hdr", !225, i64 0, !225, i64 0, !225, i64 1, !273, i64 4, !225, i64 6, !225, i64 7, !343, i64 8, !343, i64 24}
!343 = !{!"in6_addr", !225, i64 0}
!344 = !DILocation(line: 75, column: 15, scope: !345)
!345 = distinct !DILexicalBlock(scope: !331, file: !3, line: 75, column: 7)
!346 = !DILocation(line: 75, column: 7, scope: !331)
!347 = !DILocation(line: 65, column: 9, scope: !130)
!348 = !DILocalVariable(name: "nh", arg: 1, scope: !349, file: !147, line: 183, type: !242)
!349 = distinct !DISubprogram(name: "parse_icmphdr_common", scope: !147, file: !147, line: 183, type: !350, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !353)
!350 = !DISubroutineType(types: !351)
!351 = !{!80, !242, !44, !352}
!352 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !213, size: 64)
!353 = !{!348, !354, !355, !356}
!354 = !DILocalVariable(name: "data_end", arg: 2, scope: !349, file: !147, line: 184, type: !44)
!355 = !DILocalVariable(name: "icmphdr", arg: 3, scope: !349, file: !147, line: 185, type: !352)
!356 = !DILocalVariable(name: "h", scope: !349, file: !147, line: 187, type: !213)
!357 = !DILocation(line: 183, column: 68, scope: !349, inlinedAt: !358)
!358 = distinct !DILocation(line: 87, column: 14, scope: !130)
!359 = !DILocation(line: 184, column: 13, scope: !349, inlinedAt: !358)
!360 = !DILocation(line: 189, column: 8, scope: !361, inlinedAt: !358)
!361 = distinct !DILexicalBlock(scope: !349, file: !147, line: 189, column: 6)
!362 = !DILocation(line: 189, column: 14, scope: !361, inlinedAt: !358)
!363 = !DILocation(line: 189, column: 12, scope: !361, inlinedAt: !358)
!364 = !DILocation(line: 189, column: 6, scope: !349, inlinedAt: !358)
!365 = !DILocation(line: 187, column: 25, scope: !349, inlinedAt: !358)
!366 = !DILocation(line: 195, column: 12, scope: !349, inlinedAt: !358)
!367 = !{!368, !225, i64 0}
!368 = !{!"icmphdr_common", !225, i64 0, !225, i64 1, !273, i64 2}
!369 = !DILocation(line: 88, column: 51, scope: !370)
!370 = distinct !DILexicalBlock(scope: !130, file: !3, line: 88, column: 6)
!371 = !DILocation(line: 88, column: 38, scope: !370)
!372 = !DILocation(line: 92, column: 22, scope: !373)
!373 = distinct !DILexicalBlock(scope: !370, file: !3, line: 92, column: 13)
!374 = !DILocation(line: 93, column: 19, scope: !373)
!375 = !DILocation(line: 93, column: 6, scope: !373)
!376 = !DILocation(line: 107, column: 2, scope: !130)
!377 = !DILocation(line: 0, scope: !130)
!378 = !DILocation(line: 24, column: 46, scope: !379, inlinedAt: !394)
!379 = distinct !DISubprogram(name: "xdp_stats_record_action", scope: !125, file: !125, line: 24, type: !380, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !382)
!380 = !DISubroutineType(types: !381)
!381 = !{!99, !133, !99}
!382 = !{!383, !384, !385}
!383 = !DILocalVariable(name: "ctx", arg: 1, scope: !379, file: !125, line: 24, type: !133)
!384 = !DILocalVariable(name: "action", arg: 2, scope: !379, file: !125, line: 24, type: !99)
!385 = !DILocalVariable(name: "rec", scope: !379, file: !125, line: 30, type: !386)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !388, line: 10, size: 128, elements: !389)
!388 = !DIFile(filename: "./../common/xdp_stats_kern_user.h", directory: "/home/fedora/xdp-tutorial/packet03-redirecting")
!389 = !{!390, !393}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !387, file: !388, line: 11, baseType: !391, size: 64)
!391 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !47, line: 31, baseType: !392)
!392 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !387, file: !388, line: 12, baseType: !391, size: 64, offset: 64)
!394 = distinct !DILocation(line: 110, column: 9, scope: !130)
!395 = !DILocation(line: 24, column: 57, scope: !379, inlinedAt: !394)
!396 = !{!224, !224, i64 0}
!397 = !DILocation(line: 30, column: 24, scope: !379, inlinedAt: !394)
!398 = !DILocation(line: 31, column: 7, scope: !399, inlinedAt: !394)
!399 = distinct !DILexicalBlock(scope: !379, file: !125, line: 31, column: 6)
!400 = !DILocation(line: 31, column: 6, scope: !379, inlinedAt: !394)
!401 = !DILocation(line: 30, column: 18, scope: !379, inlinedAt: !394)
!402 = !DILocation(line: 38, column: 7, scope: !379, inlinedAt: !394)
!403 = !DILocation(line: 38, column: 17, scope: !379, inlinedAt: !394)
!404 = !{!405, !406, i64 0}
!405 = !{!"datarec", !406, i64 0, !406, i64 8}
!406 = !{!"long long", !225, i64 0}
!407 = !DILocation(line: 39, column: 25, scope: !379, inlinedAt: !394)
!408 = !DILocation(line: 39, column: 41, scope: !379, inlinedAt: !394)
!409 = !DILocation(line: 39, column: 34, scope: !379, inlinedAt: !394)
!410 = !DILocation(line: 39, column: 19, scope: !379, inlinedAt: !394)
!411 = !DILocation(line: 39, column: 7, scope: !379, inlinedAt: !394)
!412 = !DILocation(line: 39, column: 16, scope: !379, inlinedAt: !394)
!413 = !{!405, !406, i64 8}
!414 = !DILocation(line: 41, column: 9, scope: !379, inlinedAt: !394)
!415 = !DILocation(line: 41, column: 2, scope: !379, inlinedAt: !394)
!416 = !DILocation(line: 0, scope: !379, inlinedAt: !394)
!417 = !DILocation(line: 42, column: 1, scope: !379, inlinedAt: !394)
!418 = !DILocation(line: 110, column: 2, scope: !130)
!419 = distinct !DISubprogram(name: "xdp_redirect_func", scope: !3, file: !3, line: 115, type: !131, scopeLine: 116, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !420)
!420 = !{!421, !422, !423, !424, !425, !426, !427}
!421 = !DILocalVariable(name: "ctx", arg: 1, scope: !419, file: !3, line: 115, type: !133)
!422 = !DILocalVariable(name: "data_end", scope: !419, file: !3, line: 117, type: !44)
!423 = !DILocalVariable(name: "data", scope: !419, file: !3, line: 118, type: !44)
!424 = !DILocalVariable(name: "nh", scope: !419, file: !3, line: 119, type: !146)
!425 = !DILocalVariable(name: "eth", scope: !419, file: !3, line: 120, type: !151)
!426 = !DILocalVariable(name: "eth_type", scope: !419, file: !3, line: 121, type: !80)
!427 = !DILocalVariable(name: "action", scope: !419, file: !3, line: 122, type: !80)
!428 = !DILocation(line: 115, column: 38, scope: !419)
!429 = !DILocation(line: 122, column: 6, scope: !419)
!430 = !DILocation(line: 119, column: 20, scope: !419)
!431 = !DILocation(line: 120, column: 17, scope: !419)
!432 = !DILocation(line: 24, column: 46, scope: !379, inlinedAt: !433)
!433 = distinct !DILocation(line: 138, column: 9, scope: !419)
!434 = !DILocation(line: 24, column: 57, scope: !379, inlinedAt: !433)
!435 = !DILocation(line: 30, column: 24, scope: !379, inlinedAt: !433)
!436 = !DILocation(line: 31, column: 7, scope: !399, inlinedAt: !433)
!437 = !DILocation(line: 31, column: 6, scope: !379, inlinedAt: !433)
!438 = !DILocation(line: 118, column: 34, scope: !419)
!439 = !DILocation(line: 117, column: 38, scope: !419)
!440 = !DILocation(line: 30, column: 18, scope: !379, inlinedAt: !433)
!441 = !DILocation(line: 38, column: 7, scope: !379, inlinedAt: !433)
!442 = !DILocation(line: 38, column: 17, scope: !379, inlinedAt: !433)
!443 = !DILocation(line: 39, column: 25, scope: !379, inlinedAt: !433)
!444 = !DILocation(line: 39, column: 41, scope: !379, inlinedAt: !433)
!445 = !DILocation(line: 39, column: 34, scope: !379, inlinedAt: !433)
!446 = !DILocation(line: 39, column: 19, scope: !379, inlinedAt: !433)
!447 = !DILocation(line: 39, column: 7, scope: !379, inlinedAt: !433)
!448 = !DILocation(line: 39, column: 16, scope: !379, inlinedAt: !433)
!449 = !DILocation(line: 41, column: 9, scope: !379, inlinedAt: !433)
