; ModuleID = 'redir1_sockops.c'
source_filename = "redir1_sockops.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.bpf_sock_ops = type { i32, %union.anon, i32, i32, i32, [4 x i32], [4 x i32], i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i64, i64 }
%union.anon = type { [4 x i32] }
%struct.sock_key = type { i32, i32, i32, i32 }

@sock_key_map = global %struct.bpf_map_def { i32 2, i32 4, i32 16, i32 1, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !0
@hooker_map = global %struct.bpf_map_def { i32 18, i32 16, i32 4, i32 20, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !6
@hk_add_hmap.____fmt = private unnamed_addr constant [10 x i8] c"sport: %d\00", align 1
@redirector_sockops.____fmt = private unnamed_addr constant [9 x i8] c"serveur\0A\00", align 1
@_license = global [4 x i8] c"GPL\00", section "license", align 1, !dbg !20
@llvm.used = appending global [4 x i8*] [i8* getelementptr inbounds ([4 x i8], [4 x i8]* @_license, i32 0, i32 0), i8* bitcast (%struct.bpf_map_def* @hooker_map to i8*), i8* bitcast (i32 (%struct.bpf_sock_ops*)* @redirector_sockops to i8*), i8* bitcast (%struct.bpf_map_def* @sock_key_map to i8*)], section "llvm.metadata"

; Function Attrs: nounwind
define void @hk_add_hmap(%struct.bpf_sock_ops*) local_unnamed_addr #0 !dbg !47 {

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "sock_key_map", scope: !2, file: !8, line: 14, type: !9, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !5)
!3 = !DIFile(filename: "redir1_sockops.c", directory: "/home/ubuntu/hooker/hooker")
!4 = !{}
!5 = !{!0, !6, !20, !26, !34, !41}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "hooker_map", scope: !2, file: !8, line: 22, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "./../lib/maps.h", directory: "/home/ubuntu/hooker/hooker")
!9 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !10, line: 210, size: 224, elements: !11)
!10 = !DIFile(filename: "../headers/bpf_helpers.h", directory: "/home/ubuntu/hooker/hooker")
!11 = !{!12, !14, !15, !16, !17, !18, !19}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !9, file: !10, line: 211, baseType: !13, size: 32)
!13 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !9, file: !10, line: 212, baseType: !13, size: 32, offset: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !9, file: !10, line: 213, baseType: !13, size: 32, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !9, file: !10, line: 214, baseType: !13, size: 32, offset: 96)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !9, file: !10, line: 215, baseType: !13, size: 32, offset: 128)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_idx", scope: !9, file: !10, line: 216, baseType: !13, size: 32, offset: 160)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !9, file: !10, line: 217, baseType: !13, size: 32, offset: 192)
!20 = !DIGlobalVariableExpression(var: !21, expr: !DIExpression())
!21 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 74, type: !22, isLocal: false, isDefinition: true)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 32, elements: !24)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !{!25}
!25 = !DISubrange(count: 4)
!26 = !DIGlobalVariableExpression(var: !27, expr: !DIExpression())
!27 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !10, line: 38, type: !28, isLocal: true, isDefinition: true)
!28 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !32, !31, null}
!31 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !23)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !10, line: 22, type: !36, isLocal: true, isDefinition: true)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DISubroutineType(types: !38)
!38 = !{!31, !39, !39, !39, !40}
!39 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!40 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "bpf_sock_hash_update", scope: !2, file: !10, line: 100, type: !36, isLocal: true, isDefinition: true)
!43 = !{i32 2, !"Dwarf Version", i32 4}
!44 = !{i32 2, !"Debug Info Version", i32 3}
!45 = !{i32 1, !"wchar_size", i32 4}
!46 = !{!"clang version 6.0.0-1ubuntu2 (tags/RELEASE_600/final)"}
!47 = distinct !DISubprogram(name: "hk_add_hmap", scope: !3, file: !3, line: 24, type: !48, isLocal: false, isDefinition: true, scopeLine: 25, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !98)
!48 = !DISubroutineType(types: !49)
!49 = !{null, !50}
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock_ops", file: !52, line: 3006, size: 1472, elements: !53)
!52 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/ubuntu/hooker/hooker")
!53 = !{!54, !57, !64, !65, !66, !67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !97}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !51, file: !52, line: 3007, baseType: !55, size: 32)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !56, line: 27, baseType: !13)
!56 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "/home/ubuntu/hooker/hooker")
!57 = !DIDerivedType(tag: DW_TAG_member, scope: !51, file: !52, line: 3008, baseType: !58, size: 128, offset: 32)
!58 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !51, file: !52, line: 3008, size: 128, elements: !59)
!59 = !{!60, !62, !63}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !58, file: !52, line: 3009, baseType: !61, size: 128)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 128, elements: !24)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "reply", scope: !58, file: !52, line: 3010, baseType: !55, size: 32)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "replylong", scope: !58, file: !52, line: 3011, baseType: !61, size: 128)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !51, file: !52, line: 3013, baseType: !55, size: 32, offset: 160)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !51, file: !52, line: 3014, baseType: !55, size: 32, offset: 192)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !51, file: !52, line: 3015, baseType: !55, size: 32, offset: 224)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !51, file: !52, line: 3016, baseType: !61, size: 128, offset: 256)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !51, file: !52, line: 3017, baseType: !61, size: 128, offset: 384)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !51, file: !52, line: 3018, baseType: !55, size: 32, offset: 512)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !51, file: !52, line: 3019, baseType: !55, size: 32, offset: 544)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "is_fullsock", scope: !51, file: !52, line: 3020, baseType: !55, size: 32, offset: 576)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "snd_cwnd", scope: !51, file: !52, line: 3024, baseType: !55, size: 32, offset: 608)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "srtt_us", scope: !51, file: !52, line: 3025, baseType: !55, size: 32, offset: 640)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "bpf_sock_ops_cb_flags", scope: !51, file: !52, line: 3026, baseType: !55, size: 32, offset: 672)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !51, file: !52, line: 3027, baseType: !55, size: 32, offset: 704)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "rtt_min", scope: !51, file: !52, line: 3028, baseType: !55, size: 32, offset: 736)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "snd_ssthresh", scope: !51, file: !52, line: 3029, baseType: !55, size: 32, offset: 768)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "rcv_nxt", scope: !51, file: !52, line: 3030, baseType: !55, size: 32, offset: 800)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "snd_nxt", scope: !51, file: !52, line: 3031, baseType: !55, size: 32, offset: 832)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "snd_una", scope: !51, file: !52, line: 3032, baseType: !55, size: 32, offset: 864)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "mss_cache", scope: !51, file: !52, line: 3033, baseType: !55, size: 32, offset: 896)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "ecn_flags", scope: !51, file: !52, line: 3034, baseType: !55, size: 32, offset: 928)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "rate_delivered", scope: !51, file: !52, line: 3035, baseType: !55, size: 32, offset: 960)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "rate_interval_us", scope: !51, file: !52, line: 3036, baseType: !55, size: 32, offset: 992)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "packets_out", scope: !51, file: !52, line: 3037, baseType: !55, size: 32, offset: 1024)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "retrans_out", scope: !51, file: !52, line: 3038, baseType: !55, size: 32, offset: 1056)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "total_retrans", scope: !51, file: !52, line: 3039, baseType: !55, size: 32, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "segs_in", scope: !51, file: !52, line: 3040, baseType: !55, size: 32, offset: 1120)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "data_segs_in", scope: !51, file: !52, line: 3041, baseType: !55, size: 32, offset: 1152)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "segs_out", scope: !51, file: !52, line: 3042, baseType: !55, size: 32, offset: 1184)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "data_segs_out", scope: !51, file: !52, line: 3043, baseType: !55, size: 32, offset: 1216)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "lost_out", scope: !51, file: !52, line: 3044, baseType: !55, size: 32, offset: 1248)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "sacked_out", scope: !51, file: !52, line: 3045, baseType: !55, size: 32, offset: 1280)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "sk_txhash", scope: !51, file: !52, line: 3046, baseType: !55, size: 32, offset: 1312)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_received", scope: !51, file: !52, line: 3047, baseType: !96, size: 64, offset: 1344)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !56, line: 31, baseType: !40)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "bytes_acked", scope: !51, file: !52, line: 3048, baseType: !96, size: 64, offset: 1408)
!98 = !{!99, !100, !109, !114}
!99 = !DILocalVariable(name: "skops", arg: 1, scope: !47, file: !3, line: 24, type: !50)
!100 = !DILocalVariable(name: "skey", scope: !47, file: !3, line: 27, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "sock_key_t", file: !102, line: 24, baseType: !103)
!102 = !DIFile(filename: "./../lib/config.h", directory: "/home/ubuntu/hooker/hooker")
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sock_key", file: !102, line: 25, size: 128, elements: !104)
!104 = !{!105, !106, !107, !108}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "sip4", scope: !103, file: !102, line: 27, baseType: !55, size: 32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "dip4", scope: !103, file: !102, line: 28, baseType: !55, size: 32, offset: 32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !103, file: !102, line: 29, baseType: !55, size: 32, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !103, file: !102, line: 30, baseType: !55, size: 32, offset: 96)
!109 = !DILocalVariable(name: "____fmt", scope: !110, file: !3, line: 34, type: !111)
!110 = distinct !DILexicalBlock(scope: !47, file: !3, line: 34, column: 5)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 80, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 10)
!114 = !DILocalVariable(name: "key", scope: !115, file: !3, line: 36, type: !31)
!115 = distinct !DILexicalBlock(scope: !116, file: !3, line: 35, column: 45)
!116 = distinct !DILexicalBlock(scope: !47, file: !3, line: 35, column: 8)
!117 = !DILocation(line: 24, column: 39, scope: !47)
!118 = !DILocation(line: 27, column: 5, scope: !47)
!119 = !DILocation(line: 28, column: 24, scope: !47)
!120 = !{!121, !122, i64 24}
!121 = !{!"bpf_sock_ops", !122, i64 0, !123, i64 4, !122, i64 20, !122, i64 24, !122, i64 28, !123, i64 32, !123, i64 48, !122, i64 64, !122, i64 68, !122, i64 72, !122, i64 76, !122, i64 80, !122, i64 84, !122, i64 88, !122, i64 92, !122, i64 96, !122, i64 100, !122, i64 104, !122, i64 108, !122, i64 112, !122, i64 116, !122, i64 120, !122, i64 124, !122, i64 128, !122, i64 132, !122, i64 136, !122, i64 140, !122, i64 144, !122, i64 148, !122, i64 152, !122, i64 156, !122, i64 160, !122, i64 164, !125, i64 168, !125, i64 176}
!122 = !{!"int", !123, i64 0}
!123 = !{!"omnipotent char", !124, i64 0}
!124 = !{!"Simple C/C++ TBAA"}
!125 = !{!"long long", !123, i64 0}
!126 = !DILocation(line: 28, column: 10, scope: !47)
!127 = !DILocation(line: 28, column: 15, scope: !47)
!128 = !{!129, !122, i64 4}
!129 = !{!"sock_key", !122, i64 0, !122, i64 4, !122, i64 8, !122, i64 12}
!130 = !DILocation(line: 29, column: 24, scope: !47)
!131 = !{!121, !122, i64 28}
!132 = !DILocation(line: 29, column: 10, scope: !47)
!133 = !DILocation(line: 29, column: 15, scope: !47)
!134 = !{!129, !122, i64 0}
!135 = !DILocation(line: 30, column: 25, scope: !47)
!136 = !{!121, !122, i64 64}
!137 = !DILocation(line: 30, column: 10, scope: !47)
!138 = !DILocation(line: 30, column: 16, scope: !47)
!139 = !{!129, !122, i64 12}
!140 = !DILocation(line: 31, column: 18, scope: !47)
!141 = !{!121, !122, i64 68}
!142 = !DILocation(line: 31, column: 10, scope: !47)
!143 = !DILocation(line: 31, column: 16, scope: !47)
!144 = !{!129, !122, i64 8}
!145 = !DILocation(line: 34, column: 5, scope: !110)
!146 = !DILocation(line: 34, column: 5, scope: !47)
!147 = !DILocation(line: 35, column: 15, scope: !116)
!148 = !DILocation(line: 35, column: 26, scope: !116)
!149 = !DILocation(line: 35, column: 8, scope: !47)
!150 = !DILocation(line: 36, column: 9, scope: !115)
!151 = !DILocation(line: 36, column: 13, scope: !115)
!152 = !{!122, !122, i64 0}
!153 = !DILocation(line: 37, column: 9, scope: !115)
!154 = !DILocation(line: 38, column: 5, scope: !116)
!155 = !DILocation(line: 38, column: 5, scope: !115)
!156 = !DILocation(line: 40, column: 26, scope: !47)
!157 = !DILocation(line: 40, column: 5, scope: !47)
!158 = !DILocation(line: 41, column: 1, scope: !47)
!159 = distinct !DISubprogram(name: "redirector_sockops", scope: !3, file: !3, line: 44, type: !160, isLocal: false, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: true, unit: !2, variables: !162)
!160 = !DISubroutineType(types: !161)
!161 = !{!31, !50}
!162 = !{!163, !164, !165, !171}
!163 = !DILocalVariable(name: "skops", arg: 1, scope: !159, file: !3, line: 44, type: !50)
!164 = !DILocalVariable(name: "op", scope: !159, file: !3, line: 51, type: !55)
!165 = !DILocalVariable(name: "____fmt", scope: !166, file: !3, line: 56, type: !168)
!166 = distinct !DILexicalBlock(scope: !167, file: !3, line: 56, column: 17)
!167 = distinct !DILexicalBlock(scope: !159, file: !3, line: 53, column: 15)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 72, elements: !169)
!169 = !{!170}
!170 = !DISubrange(count: 9)
