; ModuleID = 'xdp_prog_kern_03.c'
source_filename = "xdp_prog_kern_03.c"
target datalayout = "e-m:e-p:64:64-i64:64-n32:64-S128"
target triple = "bpf"

%struct.bpf_map_def = type { i32, i32, i32, i32, i32, i32, i32 }
%struct.xdp_md = type { i32, i32, i32, i32, i32 }
%struct.hdr_cursor = type { i8* }
%struct.ethhdr = type { [6 x i8], [6 x i8], i16 }
%struct.vlan_hdr = type { i16, i16 }
%struct.iphdr = type { i8, i8, i16, i16, i16, i8, i8, i16, i32, i32 }
%struct.ipv6hdr = type { i8, [3 x i8], i16, i8, i8, %struct.in6_addr, %struct.in6_addr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.icmphdr_common = type { i8, i8, i16 }
%struct.bpf_fib_lookup = type { i8, i8, i16, i16, i16, i32, %union.anon.0, %union.anon.1, %union.anon.2, i16, i16, [6 x i8], [6 x i8] }
%union.anon.0 = type { i32 }
%union.anon.1 = type { [4 x i32] }
%union.anon.2 = type { [4 x i32] }

@xdp_stats_map = dso_local global %struct.bpf_map_def { i32 6, i32 4, i32 16, i32 5, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !0
@tx_port = dso_local global %struct.bpf_map_def { i32 14, i32 4, i32 4, i32 256, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !76
@redirect_params = dso_local global %struct.bpf_map_def { i32 1, i32 6, i32 6, i32 1, i32 0, i32 0, i32 0 }, section "maps", align 4, !dbg !88
@_license = dso_local global [4 x i8] c"GPL\00", section "license", align 1, !dbg !90

!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 8.0.0 (Fedora 8.0.0-1.fc30)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !43, globals: !75, nameTableKind: None)
!3 = !DIFile(filename: "xdp_prog_kern_03.c", directory: "/home/fedora/xdp-tutorial/packet-solutions")
!4 = !{!5, !14}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "xdp_action", file: !6, line: 2845, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "../headers/linux/bpf.h", directory: "/home/fedora/xdp-tutorial/packet-solutions")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13}
!9 = !DIEnumerator(name: "XDP_ABORTED", value: 0, isUnsigned: true)
!10 = !DIEnumerator(name: "XDP_DROP", value: 1, isUnsigned: true)
!11 = !DIEnumerator(name: "XDP_PASS", value: 2, isUnsigned: true)
!12 = !DIEnumerator(name: "XDP_TX", value: 3, isUnsigned: true)
!13 = !DIEnumerator(name: "XDP_REDIRECT", value: 4, isUnsigned: true)
!14 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !15, line: 28, baseType: !7, size: 32, elements: !16)
!15 = !DIFile(filename: "/usr/include/linux/in.h", directory: "")
!16 = !{!17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42}
!17 = !DIEnumerator(name: "IPPROTO_IP", value: 0, isUnsigned: true)
!18 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1, isUnsigned: true)
!19 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2, isUnsigned: true)
!20 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4, isUnsigned: true)
!21 = !DIEnumerator(name: "IPPROTO_TCP", value: 6, isUnsigned: true)
!22 = !DIEnumerator(name: "IPPROTO_EGP", value: 8, isUnsigned: true)
!23 = !DIEnumerator(name: "IPPROTO_PUP", value: 12, isUnsigned: true)
!24 = !DIEnumerator(name: "IPPROTO_UDP", value: 17, isUnsigned: true)
!25 = !DIEnumerator(name: "IPPROTO_IDP", value: 22, isUnsigned: true)
!26 = !DIEnumerator(name: "IPPROTO_TP", value: 29, isUnsigned: true)
!27 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33, isUnsigned: true)
!28 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41, isUnsigned: true)
!29 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46, isUnsigned: true)
!30 = !DIEnumerator(name: "IPPROTO_GRE", value: 47, isUnsigned: true)
!31 = !DIEnumerator(name: "IPPROTO_ESP", value: 50, isUnsigned: true)
!32 = !DIEnumerator(name: "IPPROTO_AH", value: 51, isUnsigned: true)
!33 = !DIEnumerator(name: "IPPROTO_MTP", value: 92, isUnsigned: true)
!34 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94, isUnsigned: true)
!35 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98, isUnsigned: true)
!36 = !DIEnumerator(name: "IPPROTO_PIM", value: 103, isUnsigned: true)
!37 = !DIEnumerator(name: "IPPROTO_COMP", value: 108, isUnsigned: true)
!38 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132, isUnsigned: true)
!39 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136, isUnsigned: true)
!40 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137, isUnsigned: true)
!41 = !DIEnumerator(name: "IPPROTO_RAW", value: 255, isUnsigned: true)
!42 = !DIEnumerator(name: "IPPROTO_MAX", value: 256, isUnsigned: true)
!43 = !{!44, !45, !46, !49, !74, !71}
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!45 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !47, line: 24, baseType: !48)
!47 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "")
!48 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !50, size: 64)
!50 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !51, line: 33, size: 128, elements: !52)
!51 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "")
!52 = !{!53}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !50, file: !51, line: 40, baseType: !54, size: 128)
!54 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !50, file: !51, line: 34, size: 128, elements: !55)
!55 = !{!56, !62, !68}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !54, file: !51, line: 35, baseType: !57, size: 128)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !60)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !47, line: 21, baseType: !59)
!59 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!60 = !{!61}
!61 = !DISubrange(count: 16)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !54, file: !51, line: 37, baseType: !63, size: 128)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 128, elements: !66)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !65, line: 25, baseType: !46)
!65 = !DIFile(filename: "/usr/include/linux/types.h", directory: "")
!66 = !{!67}
!67 = !DISubrange(count: 8)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !54, file: !51, line: 38, baseType: !69, size: 128)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 128, elements: !72)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !65, line: 27, baseType: !71)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !47, line: 27, baseType: !7)
!72 = !{!73}
!73 = !DISubrange(count: 4)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!75 = !{!0, !76, !88, !90, !94, !100, !105, !110, !115}
!76 = !DIGlobalVariableExpression(var: !77, expr: !DIExpression())
!77 = distinct !DIGlobalVariable(name: "tx_port", scope: !2, file: !3, line: 19, type: !78, isLocal: false, isDefinition: true)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_map_def", file: !79, line: 210, size: 224, elements: !80)
!79 = !DIFile(filename: "../headers/bpf_helpers.h", directory: "/home/fedora/xdp-tutorial/packet-solutions")
!80 = !{!81, !82, !83, !84, !85, !86, !87}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !78, file: !79, line: 211, baseType: !7, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "key_size", scope: !78, file: !79, line: 212, baseType: !7, size: 32, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "value_size", scope: !78, file: !79, line: 213, baseType: !7, size: 32, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !78, file: !79, line: 214, baseType: !7, size: 32, offset: 96)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !78, file: !79, line: 215, baseType: !7, size: 32, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "inner_map_idx", scope: !78, file: !79, line: 216, baseType: !7, size: 32, offset: 160)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "numa_node", scope: !78, file: !79, line: 217, baseType: !7, size: 32, offset: 192)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "redirect_params", scope: !2, file: !3, line: 26, type: !78, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "_license", scope: !2, file: !3, line: 328, type: !92, isLocal: false, isDefinition: true)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 32, elements: !72)
!93 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!94 = !DIGlobalVariableExpression(var: !95, expr: !DIExpression())
!95 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !79, line: 239, type: !96, isLocal: true, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DISubroutineType(types: !98)
!98 = !{!99, !44, !99, !44, !99, !99}
!99 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !2, file: !79, line: 55, type: !102, isLocal: true, isDefinition: true)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DISubroutineType(types: !104)
!104 = !{!99, !99, !99}
!105 = !DIGlobalVariableExpression(var: !106, expr: !DIExpression())
!106 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !79, line: 20, type: !107, isLocal: true, isDefinition: true)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DISubroutineType(types: !109)
!109 = !{!44, !44, !44}
!110 = !DIGlobalVariableExpression(var: !111, expr: !DIExpression())
!111 = distinct !DIGlobalVariable(name: "bpf_redirect_map", scope: !2, file: !79, line: 57, type: !112, isLocal: true, isDefinition: true)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DISubroutineType(types: !114)
!114 = !{!99, !44, !99, !99}
!115 = !DIGlobalVariableExpression(var: !116, expr: !DIExpression())
!116 = distinct !DIGlobalVariable(name: "bpf_fib_lookup", scope: !2, file: !79, line: 137, type: !117, isLocal: true, isDefinition: true)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DISubroutineType(types: !119)
!119 = !{!99, !44, !120, !99, !71}
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_fib_lookup", file: !6, line: 3179, size: 512, elements: !122)
!122 = !{!123, !124, !125, !126, !127, !128, !129, !135, !141, !146, !147, !148, !152}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !121, file: !6, line: 3183, baseType: !58, size: 8)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "l4_protocol", scope: !121, file: !6, line: 3186, baseType: !58, size: 8, offset: 8)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !121, file: !6, line: 3187, baseType: !64, size: 16, offset: 16)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !121, file: !6, line: 3188, baseType: !64, size: 16, offset: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !121, file: !6, line: 3191, baseType: !46, size: 16, offset: 48)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !121, file: !6, line: 3196, baseType: !71, size: 32, offset: 64)
!129 = !DIDerivedType(tag: DW_TAG_member, scope: !121, file: !6, line: 3198, baseType: !130, size: 32, offset: 96)
!130 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !121, file: !6, line: 3198, size: 32, elements: !131)
!131 = !{!132, !133, !134}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !130, file: !6, line: 3200, baseType: !58, size: 8)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "flowinfo", scope: !130, file: !6, line: 3201, baseType: !70, size: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "rt_metric", scope: !130, file: !6, line: 3204, baseType: !71, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, scope: !121, file: !6, line: 3207, baseType: !136, size: 128, offset: 128)
!136 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !121, file: !6, line: 3207, size: 128, elements: !137)
!137 = !{!138, !139}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !136, file: !6, line: 3208, baseType: !70, size: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !136, file: !6, line: 3209, baseType: !140, size: 128)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !72)
!141 = !DIDerivedType(tag: DW_TAG_member, scope: !121, file: !6, line: 3216, baseType: !142, size: 128, offset: 256)
!142 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !121, file: !6, line: 3216, size: 128, elements: !143)
!143 = !{!144, !145}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !142, file: !6, line: 3217, baseType: !70, size: 32)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !142, file: !6, line: 3218, baseType: !140, size: 128)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_proto", scope: !121, file: !6, line: 3222, baseType: !64, size: 16, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !121, file: !6, line: 3223, baseType: !64, size: 16, offset: 400)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "smac", scope: !121, file: !6, line: 3224, baseType: !149, size: 48, offset: 416)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 48, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 6)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "dmac", scope: !121, file: !6, line: 3225, baseType: !149, size: 48, offset: 464)
!153 = !DIFile(filename: "./../common/xdp_stats_kern.h", directory: "/home/fedora/xdp-tutorial/packet-solutions")
!154 = !{i32 2, !"Dwarf Version", i32 4}
!155 = !{i32 2, !"Debug Info Version", i32 3}
!156 = !{i32 1, !"wchar_size", i32 4}
!157 = !{!"clang version 8.0.0 (Fedora 8.0.0-1.fc30)"}
!158 = distinct !DISubprogram(name: "xdp_icmp_echo_func", scope: !3, file: !3, line: 58, type: !159, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !169)
!159 = !DISubroutineType(types: !160)
!160 = !{!99, !161}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "xdp_md", file: !6, line: 2856, size: 160, elements: !163)
!163 = !{!164, !165, !166, !167, !168}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !162, file: !6, line: 2857, baseType: !71, size: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !162, file: !6, line: 2858, baseType: !71, size: 32, offset: 32)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !162, file: !6, line: 2859, baseType: !71, size: 32, offset: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !162, file: !6, line: 2861, baseType: !71, size: 32, offset: 96)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_index", scope: !162, file: !6, line: 2862, baseType: !71, size: 32, offset: 128)
!169 = !{!170, !171, !172, !173, !178, !187, !188, !189, !190, !207, !223, !224, !225, !232, !233}
!170 = !DILocalVariable(name: "ctx", arg: 1, scope: !158, file: !3, line: 58, type: !161)
!171 = !DILocalVariable(name: "data_end", scope: !158, file: !3, line: 60, type: !44)
!172 = !DILocalVariable(name: "data", scope: !158, file: !3, line: 61, type: !44)
!173 = !DILocalVariable(name: "nh", scope: !158, file: !3, line: 62, type: !174)
!174 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "hdr_cursor", file: !175, line: 33, size: 64, elements: !176)
!175 = !DIFile(filename: "./../common/parsing_helpers.h", directory: "/home/fedora/xdp-tutorial/packet-solutions")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !174, file: !175, line: 34, baseType: !44, size: 64)
!178 = !DILocalVariable(name: "eth", scope: !158, file: !3, line: 63, type: !179)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !181, line: 161, size: 112, elements: !182)
!181 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "")
!182 = !{!183, !185, !186}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !180, file: !181, line: 162, baseType: !184, size: 48)
!184 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 48, elements: !150)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !180, file: !181, line: 163, baseType: !184, size: 48, offset: 48)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !180, file: !181, line: 164, baseType: !64, size: 16, offset: 96)
!187 = !DILocalVariable(name: "eth_type", scope: !158, file: !3, line: 64, type: !99)
!188 = !DILocalVariable(name: "ip_type", scope: !158, file: !3, line: 65, type: !99)
!189 = !DILocalVariable(name: "icmp_type", scope: !158, file: !3, line: 66, type: !99)
!190 = !DILocalVariable(name: "iphdr", scope: !158, file: !3, line: 67, type: !191)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !192, size: 64)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !193, line: 86, size: 160, elements: !194)
!193 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "")
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203, !205, !206}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !192, file: !193, line: 88, baseType: !58, size: 4, flags: DIFlagBitField, extraData: i64 0)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !192, file: !193, line: 89, baseType: !58, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !192, file: !193, line: 96, baseType: !58, size: 8, offset: 8)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !192, file: !193, line: 97, baseType: !64, size: 16, offset: 16)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !192, file: !193, line: 98, baseType: !64, size: 16, offset: 32)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !192, file: !193, line: 99, baseType: !64, size: 16, offset: 48)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !192, file: !193, line: 100, baseType: !58, size: 8, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !192, file: !193, line: 101, baseType: !58, size: 8, offset: 72)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !192, file: !193, line: 102, baseType: !204, size: 16, offset: 80)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !65, line: 31, baseType: !46)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !192, file: !193, line: 103, baseType: !70, size: 32, offset: 96)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !192, file: !193, line: 104, baseType: !70, size: 32, offset: 128)
!207 = !DILocalVariable(name: "ipv6hdr", scope: !158, file: !3, line: 68, type: !208)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !210, line: 116, size: 320, elements: !211)
!210 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "")
!211 = !{!212, !213, !214, !218, !219, !220, !221, !222}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !209, file: !210, line: 118, baseType: !58, size: 4, flags: DIFlagBitField, extraData: i64 0)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !209, file: !210, line: 119, baseType: !58, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !209, file: !210, line: 126, baseType: !215, size: 24, offset: 8)
!215 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 24, elements: !216)
!216 = !{!217}
!217 = !DISubrange(count: 3)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !209, file: !210, line: 128, baseType: !64, size: 16, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !209, file: !210, line: 129, baseType: !58, size: 8, offset: 48)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !209, file: !210, line: 130, baseType: !58, size: 8, offset: 56)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !209, file: !210, line: 132, baseType: !50, size: 128, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !209, file: !210, line: 133, baseType: !50, size: 128, offset: 192)
!223 = !DILocalVariable(name: "echo_reply", scope: !158, file: !3, line: 69, type: !46)
!224 = !DILocalVariable(name: "old_csum", scope: !158, file: !3, line: 69, type: !46)
!225 = !DILocalVariable(name: "icmphdr", scope: !158, file: !3, line: 70, type: !226)
!226 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !227, size: 64)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "icmphdr_common", file: !175, line: 51, size: 32, elements: !228)
!228 = !{!229, !230, !231}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !227, file: !175, line: 52, baseType: !58, size: 8)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !227, file: !175, line: 53, baseType: !58, size: 8, offset: 8)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cksum", scope: !227, file: !175, line: 54, baseType: !204, size: 16, offset: 16)
!232 = !DILocalVariable(name: "icmphdr_old", scope: !158, file: !3, line: 71, type: !227)
!233 = !DILocalVariable(name: "action", scope: !158, file: !3, line: 72, type: !71)
!234 = !DILocalVariable(name: "tmp", scope: !235, file: !236, line: 127, type: !50)
!235 = distinct !DISubprogram(name: "swap_src_dst_ipv6", scope: !236, file: !236, line: 125, type: !237, scopeLine: 126, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !239)
!236 = !DIFile(filename: "./../common/rewrite_helpers.h", directory: "/home/fedora/xdp-tutorial/packet-solutions")
!237 = !DISubroutineType(types: !238)
!238 = !{null, !208}
!239 = !{!240, !234}
!240 = !DILocalVariable(name: "ipv6", arg: 1, scope: !235, file: !236, line: 125, type: !208)
!241 = !DILocation(line: 127, column: 18, scope: !235, inlinedAt: !242)
!242 = distinct !DILocation(line: 105, column: 3, scope: !243)
!243 = distinct !DILexicalBlock(scope: !244, file: !3, line: 103, column: 43)
!244 = distinct !DILexicalBlock(scope: !245, file: !3, line: 102, column: 13)
!245 = distinct !DILexicalBlock(scope: !158, file: !3, line: 98, column: 6)
!246 = !DILocalVariable(name: "h_tmp", scope: !247, file: !236, line: 115, type: !149)
!247 = distinct !DISubprogram(name: "swap_src_dst_mac", scope: !236, file: !236, line: 113, type: !248, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !250)
!248 = !DISubroutineType(types: !249)
!249 = !{null, !179}
!250 = !{!251, !246}
!251 = !DILocalVariable(name: "eth", arg: 1, scope: !247, file: !236, line: 113, type: !179)
!252 = !DILocation(line: 115, column: 7, scope: !247, inlinedAt: !253)
!253 = distinct !DILocation(line: 112, column: 2, scope: !158)
!254 = !DILocation(line: 58, column: 39, scope: !158)
!255 = !DILocation(line: 60, column: 38, scope: !158)
!256 = !{!257, !258, i64 4}
!257 = !{!"xdp_md", !258, i64 0, !258, i64 4, !258, i64 8, !258, i64 12, !258, i64 16}
!258 = !{!"int", !259, i64 0}
!259 = !{!"omnipotent char", !260, i64 0}
!260 = !{!"Simple C/C++ TBAA"}
!261 = !DILocation(line: 60, column: 27, scope: !158)
!262 = !DILocation(line: 60, column: 19, scope: !158)
!263 = !DILocation(line: 60, column: 8, scope: !158)
!264 = !DILocation(line: 61, column: 34, scope: !158)
!265 = !{!257, !258, i64 0}
!266 = !DILocation(line: 61, column: 23, scope: !158)
!267 = !DILocation(line: 61, column: 15, scope: !158)
!268 = !DILocation(line: 61, column: 8, scope: !158)
!269 = !DILocation(line: 71, column: 2, scope: !158)
!270 = !DILocation(line: 72, column: 8, scope: !158)
!271 = !DILocation(line: 62, column: 20, scope: !158)
!272 = !DILocalVariable(name: "nh", arg: 1, scope: !273, file: !175, line: 73, type: !276)
!273 = distinct !DISubprogram(name: "parse_ethhdr", scope: !175, file: !175, line: 73, type: !274, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !278)
!274 = !DISubroutineType(types: !275)
!275 = !{!99, !276, !44, !277}
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!278 = !{!272, !279, !280, !281, !282, !283, !289, !290}
!279 = !DILocalVariable(name: "data_end", arg: 2, scope: !273, file: !175, line: 73, type: !44)
!280 = !DILocalVariable(name: "ethhdr", arg: 3, scope: !273, file: !175, line: 74, type: !277)
!281 = !DILocalVariable(name: "eth", scope: !273, file: !175, line: 76, type: !179)
!282 = !DILocalVariable(name: "hdrsize", scope: !273, file: !175, line: 77, type: !99)
!283 = !DILocalVariable(name: "vlh", scope: !273, file: !175, line: 78, type: !284)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !175, line: 42, size: 32, elements: !286)
!286 = !{!287, !288}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !285, file: !175, line: 43, baseType: !64, size: 16)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !285, file: !175, line: 44, baseType: !64, size: 16, offset: 16)
!289 = !DILocalVariable(name: "h_proto", scope: !273, file: !175, line: 79, type: !46)
!290 = !DILocalVariable(name: "i", scope: !273, file: !175, line: 80, type: !99)
!291 = !DILocation(line: 73, column: 60, scope: !273, inlinedAt: !292)
!292 = distinct !DILocation(line: 78, column: 13, scope: !158)
!293 = !DILocation(line: 73, column: 70, scope: !273, inlinedAt: !292)
!294 = !DILocation(line: 77, column: 6, scope: !273, inlinedAt: !292)
!295 = !DILocation(line: 85, column: 14, scope: !296, inlinedAt: !292)
!296 = distinct !DILexicalBlock(scope: !273, file: !175, line: 85, column: 6)
!297 = !DILocation(line: 85, column: 24, scope: !296, inlinedAt: !292)
!298 = !DILocation(line: 85, column: 6, scope: !273, inlinedAt: !292)
!299 = !DILocation(line: 76, column: 17, scope: !273, inlinedAt: !292)
!300 = !DILocation(line: 89, column: 10, scope: !273, inlinedAt: !292)
!301 = !DILocation(line: 78, column: 19, scope: !273, inlinedAt: !292)
!302 = !DILocation(line: 91, column: 17, scope: !273, inlinedAt: !292)
!303 = !DILocation(line: 79, column: 8, scope: !273, inlinedAt: !292)
!304 = !DILocation(line: 80, column: 6, scope: !273, inlinedAt: !292)
!305 = !DILocation(line: 0, scope: !273, inlinedAt: !292)
!306 = !{!307, !307, i64 0}
!307 = !{!"short", !259, i64 0}
!308 = !DILocation(line: 98, column: 7, scope: !309, inlinedAt: !292)
!309 = distinct !DILexicalBlock(scope: !310, file: !175, line: 97, column: 39)
!310 = distinct !DILexicalBlock(scope: !311, file: !175, line: 97, column: 2)
!311 = distinct !DILexicalBlock(scope: !273, file: !175, line: 97, column: 2)
!312 = !DILocation(line: 101, column: 11, scope: !313, inlinedAt: !292)
!313 = distinct !DILexicalBlock(scope: !309, file: !175, line: 101, column: 7)
!314 = !DILocation(line: 101, column: 15, scope: !313, inlinedAt: !292)
!315 = !DILocation(line: 101, column: 7, scope: !309, inlinedAt: !292)
!316 = !DILocation(line: 104, column: 18, scope: !309, inlinedAt: !292)
!317 = !DILocation(line: 64, column: 6, scope: !158)
!318 = !DILocation(line: 79, column: 6, scope: !158)
!319 = !DILocalVariable(name: "nh", arg: 1, scope: !320, file: !175, line: 131, type: !276)
!320 = distinct !DISubprogram(name: "parse_iphdr", scope: !175, file: !175, line: 131, type: !321, scopeLine: 134, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !324)
!321 = !DISubroutineType(types: !322)
!322 = !{!99, !276, !44, !323}
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!324 = !{!319, !325, !326, !327, !328}
!325 = !DILocalVariable(name: "data_end", arg: 2, scope: !320, file: !175, line: 132, type: !44)
!326 = !DILocalVariable(name: "iphdr", arg: 3, scope: !320, file: !175, line: 133, type: !323)
!327 = !DILocalVariable(name: "iph", scope: !320, file: !175, line: 135, type: !191)
!328 = !DILocalVariable(name: "hdrsize", scope: !320, file: !175, line: 136, type: !99)
!329 = !DILocation(line: 131, column: 59, scope: !320, inlinedAt: !330)
!330 = distinct !DILocation(line: 80, column: 13, scope: !331)
!331 = distinct !DILexicalBlock(scope: !332, file: !3, line: 79, column: 39)
!332 = distinct !DILexicalBlock(scope: !158, file: !3, line: 79, column: 6)
!333 = !DILocation(line: 132, column: 18, scope: !320, inlinedAt: !330)
!334 = !DILocation(line: 135, column: 16, scope: !320, inlinedAt: !330)
!335 = !DILocation(line: 138, column: 10, scope: !336, inlinedAt: !330)
!336 = distinct !DILexicalBlock(scope: !320, file: !175, line: 138, column: 6)
!337 = !DILocation(line: 138, column: 14, scope: !336, inlinedAt: !330)
!338 = !DILocation(line: 138, column: 6, scope: !320, inlinedAt: !330)
!339 = !DILocation(line: 141, column: 17, scope: !320, inlinedAt: !330)
!340 = !DILocation(line: 141, column: 21, scope: !320, inlinedAt: !330)
!341 = !DILocation(line: 144, column: 14, scope: !342, inlinedAt: !330)
!342 = distinct !DILexicalBlock(scope: !320, file: !175, line: 144, column: 6)
!343 = !DILocation(line: 136, column: 6, scope: !320, inlinedAt: !330)
!344 = !DILocation(line: 144, column: 24, scope: !342, inlinedAt: !330)
!345 = !DILocation(line: 144, column: 6, scope: !320, inlinedAt: !330)
!346 = !DILocation(line: 148, column: 9, scope: !320, inlinedAt: !330)
!347 = !DILocation(line: 150, column: 14, scope: !320, inlinedAt: !330)
!348 = !{!349, !259, i64 9}
!349 = !{!"iphdr", !259, i64 0, !259, i64 0, !259, i64 1, !307, i64 2, !307, i64 4, !307, i64 6, !259, i64 8, !259, i64 9, !307, i64 10, !258, i64 12, !258, i64 16}
!350 = !DILocation(line: 81, column: 15, scope: !351)
!351 = distinct !DILexicalBlock(scope: !331, file: !3, line: 81, column: 7)
!352 = !DILocation(line: 81, column: 7, scope: !331)
!353 = !DILocalVariable(name: "nh", arg: 1, scope: !354, file: !175, line: 112, type: !276)
!354 = distinct !DISubprogram(name: "parse_ip6hdr", scope: !175, file: !175, line: 112, type: !355, scopeLine: 115, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !358)
!355 = !DISubroutineType(types: !356)
!356 = !{!99, !276, !44, !357}
!357 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !208, size: 64)
!358 = !{!353, !359, !360, !361}
!359 = !DILocalVariable(name: "data_end", arg: 2, scope: !354, file: !175, line: 113, type: !44)
!360 = !DILocalVariable(name: "ip6hdr", arg: 3, scope: !354, file: !175, line: 114, type: !357)
!361 = !DILocalVariable(name: "ip6h", scope: !354, file: !175, line: 116, type: !208)
!362 = !DILocation(line: 112, column: 60, scope: !354, inlinedAt: !363)
!363 = distinct !DILocation(line: 84, column: 13, scope: !364)
!364 = distinct !DILexicalBlock(scope: !365, file: !3, line: 83, column: 48)
!365 = distinct !DILexicalBlock(scope: !332, file: !3, line: 83, column: 13)
!366 = !DILocation(line: 113, column: 12, scope: !354, inlinedAt: !363)
!367 = !DILocation(line: 122, column: 11, scope: !368, inlinedAt: !363)
!368 = distinct !DILexicalBlock(scope: !354, file: !175, line: 122, column: 6)
!369 = !DILocation(line: 122, column: 17, scope: !368, inlinedAt: !363)
!370 = !DILocation(line: 122, column: 15, scope: !368, inlinedAt: !363)
!371 = !DILocation(line: 122, column: 6, scope: !354, inlinedAt: !363)
!372 = !DILocation(line: 116, column: 29, scope: !354, inlinedAt: !363)
!373 = !DILocation(line: 116, column: 18, scope: !354, inlinedAt: !363)
!374 = !DILocation(line: 128, column: 15, scope: !354, inlinedAt: !363)
!375 = !{!376, !259, i64 6}
!376 = !{!"ipv6hdr", !259, i64 0, !259, i64 0, !259, i64 1, !307, i64 4, !259, i64 6, !259, i64 7, !377, i64 8, !377, i64 24}
!377 = !{!"in6_addr", !259, i64 0}
!378 = !DILocation(line: 85, column: 15, scope: !379)
!379 = distinct !DILexicalBlock(scope: !364, file: !3, line: 85, column: 7)
!380 = !DILocation(line: 85, column: 7, scope: !364)
!381 = !DILocation(line: 75, column: 9, scope: !158)
!382 = !DILocalVariable(name: "nh", arg: 1, scope: !383, file: !175, line: 183, type: !276)
!383 = distinct !DISubprogram(name: "parse_icmphdr_common", scope: !175, file: !175, line: 183, type: !384, scopeLine: 186, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !387)
!384 = !DISubroutineType(types: !385)
!385 = !{!99, !276, !44, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!387 = !{!382, !388, !389, !390}
!388 = !DILocalVariable(name: "data_end", arg: 2, scope: !383, file: !175, line: 184, type: !44)
!389 = !DILocalVariable(name: "icmphdr", arg: 3, scope: !383, file: !175, line: 185, type: !386)
!390 = !DILocalVariable(name: "h", scope: !383, file: !175, line: 187, type: !226)
!391 = !DILocation(line: 183, column: 68, scope: !383, inlinedAt: !392)
!392 = distinct !DILocation(line: 97, column: 14, scope: !158)
!393 = !DILocation(line: 184, column: 13, scope: !383, inlinedAt: !392)
!394 = !DILocation(line: 187, column: 25, scope: !383, inlinedAt: !392)
!395 = !DILocation(line: 189, column: 8, scope: !396, inlinedAt: !392)
!396 = distinct !DILexicalBlock(scope: !383, file: !175, line: 189, column: 6)
!397 = !DILocation(line: 189, column: 14, scope: !396, inlinedAt: !392)
!398 = !DILocation(line: 189, column: 12, scope: !396, inlinedAt: !392)
!399 = !DILocation(line: 189, column: 6, scope: !383, inlinedAt: !392)
!400 = !DILocation(line: 195, column: 12, scope: !383, inlinedAt: !392)
!401 = !{!402, !259, i64 0}
!402 = !{!"icmphdr_common", !259, i64 0, !259, i64 1, !307, i64 2}
!403 = !DILocation(line: 98, column: 51, scope: !245)
!404 = !DILocation(line: 98, column: 38, scope: !245)
!405 = !DILocation(line: 67, column: 16, scope: !158)
!406 = !DILocalVariable(name: "iphdr", arg: 1, scope: !407, file: !236, line: 136, type: !191)
!407 = distinct !DISubprogram(name: "swap_src_dst_ipv4", scope: !236, file: !236, line: 136, type: !408, scopeLine: 137, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !410)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !191}
!410 = !{!406, !411}
!411 = !DILocalVariable(name: "tmp", scope: !407, file: !236, line: 138, type: !70)
!412 = !DILocation(line: 136, column: 61, scope: !407, inlinedAt: !413)
!413 = distinct !DILocation(line: 100, column: 3, scope: !414)
!414 = distinct !DILexicalBlock(scope: !245, file: !3, line: 98, column: 65)
!415 = !DILocation(line: 138, column: 22, scope: !407, inlinedAt: !413)
!416 = !{!349, !258, i64 12}
!417 = !DILocation(line: 138, column: 9, scope: !407, inlinedAt: !413)
!418 = !DILocation(line: 140, column: 24, scope: !407, inlinedAt: !413)
!419 = !{!349, !258, i64 16}
!420 = !DILocation(line: 140, column: 15, scope: !407, inlinedAt: !413)
!421 = !DILocation(line: 141, column: 15, scope: !407, inlinedAt: !413)
!422 = !DILocation(line: 69, column: 8, scope: !158)
!423 = !DILocation(line: 102, column: 2, scope: !414)
!424 = !DILocation(line: 102, column: 22, scope: !244)
!425 = !DILocation(line: 103, column: 19, scope: !244)
!426 = !DILocation(line: 103, column: 6, scope: !244)
!427 = !DILocation(line: 68, column: 18, scope: !158)
!428 = !DILocation(line: 125, column: 63, scope: !235, inlinedAt: !242)
!429 = !DILocation(line: 127, column: 2, scope: !235, inlinedAt: !242)
!430 = !DILocation(line: 127, column: 30, scope: !235, inlinedAt: !242)
!431 = !DILocation(line: 129, column: 22, scope: !235, inlinedAt: !242)
!432 = !{i64 0, i64 16, !433, i64 0, i64 16, !433, i64 0, i64 16, !433}
!433 = !{!259, !259, i64 0}
!434 = !DILocation(line: 130, column: 16, scope: !235, inlinedAt: !242)
!435 = !DILocation(line: 131, column: 1, scope: !235, inlinedAt: !242)
!436 = !DILocation(line: 63, column: 17, scope: !158)
!437 = !DILocation(line: 113, column: 61, scope: !247, inlinedAt: !253)
!438 = !DILocation(line: 115, column: 2, scope: !247, inlinedAt: !253)
!439 = !DILocation(line: 117, column: 2, scope: !247, inlinedAt: !253)
!440 = !DILocation(line: 118, column: 2, scope: !247, inlinedAt: !253)
!441 = !DILocation(line: 119, column: 2, scope: !247, inlinedAt: !253)
!442 = !DILocation(line: 120, column: 1, scope: !247, inlinedAt: !253)
!443 = !DILocation(line: 70, column: 25, scope: !158)
!444 = !DILocation(line: 116, column: 22, scope: !158)
!445 = !{!402, !307, i64 2}
!446 = !DILocation(line: 69, column: 20, scope: !158)
!447 = !DILocation(line: 117, column: 17, scope: !158)
!448 = !DILocation(line: 118, column: 17, scope: !158)
!449 = !DILocation(line: 118, column: 16, scope: !158)
!450 = !DILocation(line: 119, column: 16, scope: !158)
!451 = !DILocation(line: 120, column: 38, scope: !158)
!452 = !DILocation(line: 71, column: 24, scope: !158)
!453 = !DILocalVariable(name: "seed", arg: 1, scope: !454, file: !3, line: 46, type: !46)
!454 = distinct !DISubprogram(name: "icmp_checksum_diff", scope: !3, file: !3, line: 45, type: !455, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !457)
!455 = !DISubroutineType(types: !456)
!456 = !{!46, !46, !226, !226}
!457 = !{!453, !458, !459, !460, !461}
!458 = !DILocalVariable(name: "icmphdr_new", arg: 2, scope: !454, file: !3, line: 47, type: !226)
!459 = !DILocalVariable(name: "icmphdr_old", arg: 3, scope: !454, file: !3, line: 48, type: !226)
!460 = !DILocalVariable(name: "csum", scope: !454, file: !3, line: 50, type: !71)
!461 = !DILocalVariable(name: "size", scope: !454, file: !3, line: 50, type: !71)
!462 = !DILocation(line: 46, column: 9, scope: !454, inlinedAt: !463)
!463 = distinct !DILocation(line: 120, column: 19, scope: !158)
!464 = !DILocation(line: 47, column: 26, scope: !454, inlinedAt: !463)
!465 = !DILocation(line: 48, column: 26, scope: !454, inlinedAt: !463)
!466 = !DILocation(line: 50, column: 14, scope: !454, inlinedAt: !463)
!467 = !DILocation(line: 52, column: 61, scope: !454, inlinedAt: !463)
!468 = !DILocation(line: 52, column: 9, scope: !454, inlinedAt: !463)
!469 = !DILocation(line: 50, column: 8, scope: !454, inlinedAt: !463)
!470 = !DILocalVariable(name: "csum", arg: 1, scope: !471, file: !3, line: 33, type: !71)
!471 = distinct !DISubprogram(name: "csum_fold_helper", scope: !3, file: !3, line: 33, type: !472, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !474)
!472 = !DISubroutineType(types: !473)
!473 = !{!46, !71}
!474 = !{!470}
!475 = !DILocation(line: 33, column: 53, scope: !471, inlinedAt: !476)
!476 = distinct !DILocation(line: 53, column: 9, scope: !454, inlinedAt: !463)
!477 = !DILocation(line: 35, column: 35, scope: !471, inlinedAt: !476)
!478 = !DILocation(line: 35, column: 27, scope: !471, inlinedAt: !476)
!479 = !DILocation(line: 35, column: 9, scope: !471, inlinedAt: !476)
!480 = !DILocation(line: 120, column: 17, scope: !158)
!481 = !DILocation(line: 143, column: 2, scope: !158)
!482 = !DILocation(line: 0, scope: !158)
!483 = !DILocation(line: 24, column: 46, scope: !484, inlinedAt: !499)
!484 = distinct !DISubprogram(name: "xdp_stats_record_action", scope: !153, file: !153, line: 24, type: !485, scopeLine: 25, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !487)
!485 = !DISubroutineType(types: !486)
!486 = !{!71, !161, !71}
!487 = !{!488, !489, !490}
!488 = !DILocalVariable(name: "ctx", arg: 1, scope: !484, file: !153, line: 24, type: !161)
!489 = !DILocalVariable(name: "action", arg: 2, scope: !484, file: !153, line: 24, type: !71)
!490 = !DILocalVariable(name: "rec", scope: !484, file: !153, line: 30, type: !491)
!491 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !492, size: 64)
!492 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "datarec", file: !493, line: 10, size: 128, elements: !494)
!493 = !DIFile(filename: "./../common/xdp_stats_kern_user.h", directory: "/home/fedora/xdp-tutorial/packet-solutions")
!494 = !{!495, !498}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "rx_packets", scope: !492, file: !493, line: 11, baseType: !496, size: 64)
!496 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !47, line: 31, baseType: !497)
!497 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!498 = !DIDerivedType(tag: DW_TAG_member, name: "rx_bytes", scope: !492, file: !493, line: 12, baseType: !496, size: 64, offset: 64)
!499 = distinct !DILocation(line: 146, column: 9, scope: !158)
!500 = !DILocation(line: 24, column: 57, scope: !484, inlinedAt: !499)
!501 = !{!258, !258, i64 0}
!502 = !DILocation(line: 30, column: 24, scope: !484, inlinedAt: !499)
!503 = !DILocation(line: 31, column: 7, scope: !504, inlinedAt: !499)
!504 = distinct !DILexicalBlock(scope: !484, file: !153, line: 31, column: 6)
!505 = !DILocation(line: 31, column: 6, scope: !484, inlinedAt: !499)
!506 = !DILocation(line: 30, column: 18, scope: !484, inlinedAt: !499)
!507 = !DILocation(line: 38, column: 7, scope: !484, inlinedAt: !499)
!508 = !DILocation(line: 38, column: 17, scope: !484, inlinedAt: !499)
!509 = !{!510, !511, i64 0}
!510 = !{!"datarec", !511, i64 0, !511, i64 8}
!511 = !{!"long long", !259, i64 0}
!512 = !DILocation(line: 39, column: 25, scope: !484, inlinedAt: !499)
!513 = !DILocation(line: 39, column: 41, scope: !484, inlinedAt: !499)
!514 = !DILocation(line: 39, column: 34, scope: !484, inlinedAt: !499)
!515 = !DILocation(line: 39, column: 19, scope: !484, inlinedAt: !499)
!516 = !DILocation(line: 39, column: 7, scope: !484, inlinedAt: !499)
!517 = !DILocation(line: 39, column: 16, scope: !484, inlinedAt: !499)
!518 = !{!510, !511, i64 8}
!519 = !DILocation(line: 41, column: 9, scope: !484, inlinedAt: !499)
!520 = !DILocation(line: 41, column: 2, scope: !484, inlinedAt: !499)
!521 = !DILocation(line: 0, scope: !484, inlinedAt: !499)
!522 = !DILocation(line: 42, column: 1, scope: !484, inlinedAt: !499)
!523 = !DILocation(line: 147, column: 1, scope: !158)
!524 = !DILocation(line: 146, column: 2, scope: !158)
!525 = distinct !DISubprogram(name: "xdp_redirect_func", scope: !3, file: !3, line: 151, type: !159, scopeLine: 152, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !526)
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535}
!527 = !DILocalVariable(name: "ctx", arg: 1, scope: !525, file: !3, line: 151, type: !161)
!528 = !DILocalVariable(name: "data_end", scope: !525, file: !3, line: 153, type: !44)
!529 = !DILocalVariable(name: "data", scope: !525, file: !3, line: 154, type: !44)
!530 = !DILocalVariable(name: "nh", scope: !525, file: !3, line: 155, type: !174)
!531 = !DILocalVariable(name: "eth", scope: !525, file: !3, line: 156, type: !179)
!532 = !DILocalVariable(name: "eth_type", scope: !525, file: !3, line: 157, type: !99)
!533 = !DILocalVariable(name: "action", scope: !525, file: !3, line: 158, type: !99)
!534 = !DILocalVariable(name: "dst", scope: !525, file: !3, line: 159, type: !184)
!535 = !DILocalVariable(name: "ifindex", scope: !525, file: !3, line: 160, type: !7)
!536 = !DILocation(line: 151, column: 38, scope: !525)
!537 = !DILocation(line: 153, column: 38, scope: !525)
!538 = !DILocation(line: 153, column: 27, scope: !525)
!539 = !DILocation(line: 153, column: 19, scope: !525)
!540 = !DILocation(line: 153, column: 8, scope: !525)
!541 = !DILocation(line: 154, column: 34, scope: !525)
!542 = !DILocation(line: 154, column: 23, scope: !525)
!543 = !DILocation(line: 154, column: 15, scope: !525)
!544 = !DILocation(line: 154, column: 8, scope: !525)
!545 = !DILocation(line: 158, column: 6, scope: !525)
!546 = !DILocation(line: 159, column: 2, scope: !525)
!547 = !DILocation(line: 159, column: 16, scope: !525)
!548 = !DILocation(line: 160, column: 11, scope: !525)
!549 = !DILocation(line: 155, column: 20, scope: !525)
!550 = !DILocation(line: 73, column: 60, scope: !273, inlinedAt: !551)
!551 = distinct !DILocation(line: 166, column: 13, scope: !525)
!552 = !DILocation(line: 73, column: 70, scope: !273, inlinedAt: !551)
!553 = !DILocation(line: 77, column: 6, scope: !273, inlinedAt: !551)
!554 = !DILocation(line: 85, column: 14, scope: !296, inlinedAt: !551)
!555 = !DILocation(line: 85, column: 24, scope: !296, inlinedAt: !551)
